IRP/src/AccumulationRegisters/R5020B_PartnersBalance/R5020B_PartnersBalance.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R5020B_PartnersBalance</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>CustomerTransaction</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>CustomerAdvance</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>VendorTransaction</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>VendorAdvance</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>OtherTransaction</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>AdvancesClosing</name>
  <type>
   <types>DocumentRef.VendorsAdvancesClosing</types>
   <types>DocumentRef.CustomersAdvancesClosing</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Document</name>
  <type>
   <types>DefinedType.typeApArTransactionBasises</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/InformationRegisters/T2010S_OffsetOfAdvances/T2010S_OffsetOfAdvances.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T2010S_OffsetOfAdvances</name>
 <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Document</name>
  <type>
   <types>DocumentRef.SalesReportFromTradeAgent</types>
   <types>DocumentRef.CashPayment</types>
   <types>DocumentRef.PurchaseInvoice</types>
   <types>DocumentRef.DebitNote</types>
   <types>DocumentRef.CreditNote</types>
   <types>DocumentRef.BankReceipt</types>
   <types>DocumentRef.PurchaseReturn</types>
   <types>DocumentRef.DebitCreditNote</types>
   <types>DocumentRef.BankPayment</types>
   <types>DocumentRef.EmployeeCashAdvance</types>
   <types>DocumentRef.ChequeBondTransactionItem</types>
   <types>DocumentRef.CashReceipt</types>
   <types>DocumentRef.OpeningEntry</types>
   <types>DocumentRef.RetailReturnReceipt</types>
   <types>DocumentRef.SalesReturn</types>
   <types>DocumentRef.RetailSalesReceipt</types>
   <types>DocumentRef.SalesReportToConsignor</types>
   <types>DocumentRef.PurchaseOrderClosing</types>
   <types>DocumentRef.SalesOrderClosing</types>
   <types>DocumentRef.SalesInvoice</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RecordType</name>
  <type>
   <types>EnumRef.RecordType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsAdvanceRelease</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionDocument</name>
  <type>
   <types>DocumentRef.SalesReportFromTradeAgent</types>
   <types>DocumentRef.CashTransferOrder</types>
   <types>DocumentRef.PurchaseInvoice</types>
   <types>DocumentRef.DebitNote</types>
   <types>DocumentRef.CreditNote</types>
   <types>DocumentRef.PurchaseReturn</types>
   <types>DocumentRef.OpeningEntry</types>
   <types>DocumentRef.SalesReturn</types>
   <types>DocumentRef.SalesReportToConsignor</types>
   <types>DocumentRef.SalesInvoice</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_TransactionAgreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_AdvanceAgreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>AdvanceOrder</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
   <types>DocumentRef.SalesOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionOrder</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
   <types>DocumentRef.SalesOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_FromAdvanceKey</name>
  <type>
   <types>CatalogRef.DELETE_AdvancesKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_ToTransactionKey</name>
  <type>
   <types>CatalogRef.DELETE_TransactionsKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_FromTransactionKey</name>
  <type>
   <types>CatalogRef.DELETE_TransactionsKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>DELETE_ToAdvanceKey</name>
  <type>
   <types>CatalogRef.DELETE_AdvancesKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>AdvanceProject</name>
  <type>
   <types>CatalogRef.Projects</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionProject</name>
  <type>
   <types>CatalogRef.Projects</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Key</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/RecordType/RecordType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>RecordType</name>
 <enumValues>
  <name>Expense</name>
 </enumValues>
 <enumValues>
  <name>Receipt</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/OutgoingPaymentTransactionTypes/OutgoingPaymentTransactionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>OutgoingPaymentTransactionTypes</name>
 <enumValues>
  <name>PaymentToVendor</name>
 </enumValues>
 <enumValues>
  <name>CurrencyExchange</name>
 </enumValues>
 <enumValues>
  <name>CashTransferOrder</name>
 </enumValues>
 <enumValues>
  <name>ReturnToCustomer</name>
 </enumValues>
 <enumValues>
  <name>ReturnToCustomerByPOS</name>
 </enumValues>
 <enumValues>
  <name>PaymentByCheque</name>
 </enumValues>
 <enumValues>
  <name>RetailCustomerAdvance</name>
 </enumValues>
 <enumValues>
  <name>EmployeeCashAdvance</name>
 </enumValues>
 <enumValues>
  <name>SalaryPayment</name>
 </enumValues>
 <enumValues>
  <name>OtherExpense</name>
 </enumValues>
 <enumValues>
  <name>OtherPartner</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/IncomingPaymentTransactionType/IncomingPaymentTransactionType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>IncomingPaymentTransactionType</name>
 <enumValues>
  <name>PaymentFromCustomer</name>
 </enumValues>
 <enumValues>
  <name>CurrencyExchange</name>
 </enumValues>
 <enumValues>
  <name>CashTransferOrder</name>
 </enumValues>
 <enumValues>
  <name>TransferFromPOS</name>
 </enumValues>
 <enumValues>
  <name>ReturnFromVendor</name>
 </enumValues>
 <enumValues>
  <name>PaymentFromCustomerByPOS</name>
 </enumValues>
 <enumValues>
  <name>ReceiptByCheque</name>
 </enumValues>
 <enumValues>
  <name>CashIn</name>
 </enumValues>
 <enumValues>
  <name>RetailCustomerAdvance</name>
 </enumValues>
 <enumValues>
  <name>EmployeeCashAdvance</name>
 </enumValues>
 <enumValues>
  <name>OtherIncome</name>
 </enumValues>
 <enumValues>
  <name>OtherPartner</name>
 </enumValues>
 <enumValues>
  <name>SalaryReturn</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/RetailReceiptStatusTypes/RetailReceiptStatusTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>RetailReceiptStatusTypes</name>
 <enumValues>
  <name>Completed</name>
 </enumValues>
 <enumValues>
  <name>Canceled</name>
 </enumValues>
 <enumValues>
  <name>Postponed</name>
 </enumValues>
 <enumValues>
  <name>PostponedWithReserve</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Companies</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>MainCompany</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CompanyLegalType</types>
  </type>
 </attributes>
 <attributes>
  <name>OurCompany</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostFillEmptyAmount</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostPriceTypeForEmptyAmount</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>MainPhoneNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualVacation</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysVacation</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualSickLeave</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysSickLeave</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryBasicPayroll</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfo</name>
  <type>
   <types>CatalogRef.PrintInfo</types>
  </type>
 </attributes>
 <attributes>
  <name>MainLegalAddress</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LegalCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>BillingEmail</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EntityID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/AccumulationRegisters/R5020B_PartnersBalance/ManagerModule.bsl
#Region AccessObject

// Get access key.
// See Role.TemplateAccumulationRegisters - Parameters orders has to be the same
// 
// Returns:
//  Structure - Get access key:
// * Company - CatalogRef.Companies -
// * Branch - CatalogRef.BusinessUnits -
Function GetAccessKey() Export
	AccessKeyStructure = New Structure;
	AccessKeyStructure.Insert("Company", Catalogs.Companies.EmptyRef());
	AccessKeyStructure.Insert("Branch", Catalogs.BusinessUnits.EmptyRef());
	Return AccessKeyStructure;
EndFunction

#EndRegion

Function R5020B_PartnersBalance_BP_CP() Export
	Return 
		"SELECT
		|	CASE
		|		WHEN OffsetOfAdvances.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Receipt)
		|		ELSE VALUE(AccumulationRecordType.Expense)
		|	END AS RecordType,
		|
		|	CASE
		|		WHEN OffsetOfAdvances.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Expense)
		|		ELSE VALUE(AccumulationRecordType.Receipt)
		|	END AS RecordType_Reverse,
		|
		|	OffsetOfAdvances.Period,
		|	OffsetOfAdvances.Company,
		|	OffsetOfAdvances.Branch,
		|	OffsetOfAdvances.Partner,
		|	OffsetOfAdvances.LegalName,
		|	OffsetOfAdvances.AdvanceAgreement,
		|	OffsetOfAdvances.TransactionAgreement,
		|	OffsetOfAdvances.TransactionDocument,
		|	OffsetOfAdvances.Currency,
		|	OffsetOfAdvances.Amount,
		|	OffsetOfAdvances.Document.TransactionType = VALUE(Enum.OutgoingPaymentTransactionTypes.PaymentToVendor) AS
		|		IsPaymentToVendor,
		|	OffsetOfAdvances.Document.TransactionType = VALUE(Enum.OutgoingPaymentTransactionTypes.ReturnToCustomer) AS
		|		IsReturnToCustomer,
		|	OffsetOfAdvances.Document.TransactionType = VALUE(Enum.OutgoingPaymentTransactionTypes.ReturnToCustomerByPOS) AS
		|		IsReturnToCustomerByPOS,
		|	OffsetOfAdvances.Recorder AS AdvancesClosing,
		|	OffsetOfAdvances.Key
		|INTO OffsetPartnersBalance
		|FROM
		|	InformationRegister.T2010S_OffsetOfAdvances AS OffsetOfAdvances
		|WHERE
		|	OffsetOfAdvances.Document = &Ref
		|	AND (OffsetOfAdvances.Recorder REFS Document.VendorsAdvancesClosing
		|	OR OffsetOfAdvances.Recorder REFS Document.CustomersAdvancesClosing)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	PaymentList.Period,
		|	PaymentList.Company,
		|	PaymentList.Branch,
		|	PaymentList.Partner,
		|	PaymentList.LegalName,
		|	PaymentList.AdvanceAgreement AS Agreement,
		|	UNDEFINED AS Document,
		|	PaymentList.Currency,
		|	0 AS Amount,
		|	0 AS CustomerTransaction,
		|	CASE
		|		WHEN PaymentList.IsReturnToCustomer
		|		OR PaymentList.IsReturnToCustomerByPOS
		|			THEN PaymentList.Amount
		|		ELSE 0
		|	END AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	CASE
		|		WHEN PaymentList.IsPaymentToVendor
		|			THEN PaymentList.Amount
		|		ELSE 0
		|	END AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	UNDEFINED AS AdvancesClosing,
		|	PaymentList.Key
		|INTO R5020B_PartnersBalance
		|FROM
		|	PaymentList AS PaymentList
		|WHERE
		|	PaymentList.IsAdvance
		|	AND (PaymentList.IsPaymentToVendor
		|	OR PaymentList.IsReturnToCustomer
		|	OR PaymentList.IsReturnToCustomerByPOS)
		|
		|UNION ALL
		|
		|SELECT // vendor advance offset
		|
		|	OffsetPartnersBalance.RecordType,
		|	OffsetPartnersBalance.Period,
		|	OffsetPartnersBalance.Company,
		|	OffsetPartnersBalance.Branch,
		|	OffsetPartnersBalance.Partner,
		|	OffsetPartnersBalance.LegalName,
		|	OffsetPartnersBalance.AdvanceAgreement,
		|	UNDEFINED,
		|	OffsetPartnersBalance.Currency,
		|	0 AS Amount,
		|	0 AS CustomerTransaction,
		|	CASE
		|		WHEN OffsetPartnersBalance.IsReturnToCustomer
		|		OR OffsetPartnersBalance.IsReturnToCustomerByPOS
		|			THEN OffsetPartnersBalance.Amount
		|		ELSE 0
		|	END AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	CASE
		|		WHEN OffsetPartnersBalance.IsPaymentToVendor
		|			THEN OffsetPartnersBalance.Amount
		|		ELSE 0
		|	END AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	OffsetPartnersBalance.AdvancesClosing,
		|	OffsetPartnersBalance.Key
		|FROM
		|	OffsetPartnersBalance AS OffsetPartnersBalance
		|WHERE
		|	OffsetPartnersBalance.IsPaymentToVendor
		|	OR OffsetPartnersBalance.IsReturnToCustomer
		|	OR OffsetPartnersBalance.IsReturnToCustomerByPOS
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	PaymentList.Period,
		|	PaymentList.Company,
		|	PaymentList.Branch,
		|	PaymentList.Partner,
		|	PaymentList.LegalName,
		|	PaymentList.Agreement,
		|	PaymentList.TransactionDocument,
		|	PaymentList.Currency,
		|	0 AS Amount,
		|	CASE
		|		WHEN PaymentList.IsReturnToCustomer
		|		OR PaymentList.IsReturnToCustomerByPOS
		|			THEN PaymentList.Amount
		|		ELSE 0
		|	END AS CustomerTransaction,
		|	0 AS CustomerAdvance,
		|	CASE
		|		WHEN PaymentList.IsPaymentToVendor
		|			THEN PaymentList.Amount
		|		ELSE 0
		|	END AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	UNDEFINED,
		|	PaymentList.Key
		|FROM
		|	PaymentList AS PaymentList
		|WHERE
		|	NOT PaymentList.IsAdvance
		|	AND (PaymentList.IsPaymentToVendor
		|	OR PaymentList.IsReturnToCustomer
		|	OR PaymentList.IsReturnToCustomerByPOS)
		|
		|UNION ALL
		|
		|SELECT
		|	OffsetPartnersBalance.RecordType_Reverse,
		|	OffsetPartnersBalance.Period,
		|	OffsetPartnersBalance.Company,
		|	OffsetPartnersBalance.Branch,
		|	OffsetPartnersBalance.Partner,
		|	OffsetPartnersBalance.LegalName,
		|	OffsetPartnersBalance.TransactionAgreement,
		|	OffsetPartnersBalance.TransactionDocument,
		|	OffsetPartnersBalance.Currency,
		|	0 AS Amount,
		|	CASE
		|		WHEN OffsetPartnersBalance.IsReturnToCustomer
		|		OR OffsetPartnersBalance.IsReturnToCustomerByPOS
		|			THEN OffsetPartnersBalance.Amount
		|		ELSE 0
		|	END AS CustomerTransaction,
		|	0 AS CustomerAdvance,
		|	CASE
		|		WHEN OffsetPartnersBalance.IsPaymentToVendor
		|			THEN OffsetPartnersBalance.Amount
		|		ELSE 0
		|	END AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	OffsetPartnersBalance.AdvancesClosing,
		|	OffsetPartnersBalance.Key
		|FROM
		|	OffsetPartnersBalance AS OffsetPartnersBalance
		|WHERE
		|	(OffsetPartnersBalance.IsPaymentToVendor
		|	OR OffsetPartnersBalance.IsReturnToCustomer
		|	OR OffsetPartnersBalance.IsReturnToCustomerByPOS)
		|
		|UNION ALL
		|
		|SELECT
		|
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	PaymentList.Period,
		|	PaymentList.Company,
		|	PaymentList.Branch,
		|	PaymentList.Partner,
		|	PaymentList.LegalName,
		|	PaymentList.Agreement,
		|	UNDEFINED AS Document,
		|	PaymentList.Currency,
		|	0 AS Amount,
		|	0 AS CustomerTransaction,
		|	0 AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	PaymentList.Amount AS OtherTransaction,
		|	UNDEFINED AS AdvancesClosing,
		|	PaymentList.Key
		|FROM
		|	PaymentList AS PaymentList
		|WHERE
		|	PaymentList.IsOtherPartner";
EndFunction

Function R5020B_PartnersBalance_BR_CR() Export
	Return 
		"SELECT
		|	CASE
		|		WHEN OffsetOfAdvances.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Receipt)
		|		ELSE VALUE(AccumulationRecordType.Expense)
		|	END AS RecordType,
		|
		|	CASE
		|		WHEN OffsetOfAdvances.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Expense)
		|		ELSE VALUE(AccumulationRecordType.Receipt)
		|	END AS RecordType_Reverse,
		|
		|	OffsetOfAdvances.Period,
		|	OffsetOfAdvances.Company,
		|	OffsetOfAdvances.Branch,
		|	OffsetOfAdvances.Partner,
		|	OffsetOfAdvances.LegalName,
		|	OffsetOfAdvances.AdvanceAgreement,
		|	OffsetOfAdvances.TransactionAgreement,
		|	OffsetOfAdvances.TransactionDocument,
		|	OffsetOfAdvances.Currency,
		|	OffsetOfAdvances.Amount,
		|	OffsetOfAdvances.Document.TransactionType = VALUE(Enum.IncomingPaymentTransactionType.PaymentFromCustomer) AS
		|		IsPaymentFromCustomer,
		|	OffsetOfAdvances.Document.TransactionType = VALUE(Enum.IncomingPaymentTransactionType.ReturnFromVendor) AS
		|		IsReturnFromVendor,
		|	OffsetOfAdvances.Document.TransactionType = VALUE(Enum.IncomingPaymentTransactionType.PaymentFromCustomerByPOS) AS
		|		IsPaymentFromCustomerByPOS,
		|	OffsetOfAdvances.Recorder AS AdvancesClosing,
		|	OffsetOfAdvances.Key
		|INTO OffsetPartnersBalance
		|FROM
		|	InformationRegister.T2010S_OffsetOfAdvances AS OffsetOfAdvances
		|WHERE
		|	OffsetOfAdvances.Document = &Ref
		|	AND (OffsetOfAdvances.Recorder REFS Document.VendorsAdvancesClosing
		|	OR OffsetOfAdvances.Recorder REFS Document.CustomersAdvancesClosing)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	VALUE(AccumulationRecordType.Expense) AS RecordType,
		|	PaymentList.Period,
		|	PaymentList.Company,
		|	PaymentList.Branch,
		|	PaymentList.Partner,
		|	PaymentList.LegalName,
		|	PaymentList.AdvanceAgreement AS Agreement,
		|	UNDEFINED AS Document,
		|	PaymentList.Currency,
		|	0 AS Amount,
		|	0 AS CustomerTransaction,
		|	CASE
		|		WHEN PaymentList.IsPaymentFromCustomer
		|		OR PaymentList.IsPaymentFromCustomerByPOS
		|			THEN PaymentList.Amount
		|		ELSE 0
		|	END AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	CASE
		|		WHEN PaymentList.IsReturnFromVendor
		|			THEN PaymentList.Amount
		|		ELSE 0
		|	END AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	UNDEFINED AS AdvancesClosing,
		|	PaymentList.Key
		|INTO R5020B_PartnersBalance
		|FROM
		|	PaymentList AS PaymentList
		|WHERE
		|	PaymentList.IsAdvance
		|	AND (PaymentList.IsPaymentFromCustomer
		|	OR PaymentList.IsReturnFromVendor
		|	OR PaymentList.IsPaymentFromCustomerByPOS)
		|
		|UNION ALL
		|
		|SELECT
		|	OffsetPartnersBalance.RecordType,
		|	OffsetPartnersBalance.Period,
		|	OffsetPartnersBalance.Company,
		|	OffsetPartnersBalance.Branch,
		|	OffsetPartnersBalance.Partner,
		|	OffsetPartnersBalance.LegalName,
		|	OffsetPartnersBalance.AdvanceAgreement,
		|	UNDEFINED,
		|	OffsetPartnersBalance.Currency,
		|	0 AS Amount,
		|	0 AS CustomerTransaction,
		|	CASE
		|		WHEN OffsetPartnersBalance.IsPaymentFromCustomer
		|		OR OffsetPartnersBalance.IsPaymentFromCustomerByPOS
		|			THEN OffsetPartnersBalance.Amount
		|		ELSE 0
		|	END AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	CASE
		|		WHEN OffsetPartnersBalance.IsReturnFromVendor
		|			THEN OffsetPartnersBalance.Amount
		|		ELSE 0
		|	END AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	OffsetPartnersBalance.AdvancesClosing,
		|	OffsetPartnersBalance.Key
		|FROM
		|	OffsetPartnersBalance AS OffsetPartnersBalance
		|WHERE
		|	OffsetPartnersBalance.IsPaymentFromCustomer
		|	OR OffsetPartnersBalance.IsReturnFromVendor
		|	OR OffsetPartnersBalance.IsPaymentFromCustomerByPOS
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(AccumulationRecordType.Expense) AS RecordType,
		|	PaymentList.Period,
		|	PaymentList.Company,
		|	PaymentList.Branch,
		|	PaymentList.Partner,
		|	PaymentList.LegalName,
		|	PaymentList.Agreement,
		|	PaymentList.TransactionDocument,
		|	PaymentList.Currency,
		|	0 AS Amount,
		|	CASE
		|		WHEN PaymentList.IsPaymentFromCustomer
		|		OR PaymentList.IsPaymentFromCustomerByPOS
		|			THEN PaymentList.Amount
		|		ELSE 0
		|	END AS CustomerTransaction,
		|	0 AS CustomerAdvance,
		|	CASE
		|		WHEN PaymentList.IsReturnFromVendor
		|			THEN PaymentList.Amount
		|		ELSE 0
		|	END AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	UNDEFINED,
		|	PaymentList.Key
		|FROM
		|	PaymentList AS PaymentList
		|WHERE
		|	NOT PaymentList.IsAdvance
		|	AND (PaymentList.IsPaymentFromCustomer
		|	OR PaymentList.IsReturnFromVendor
		|	OR PaymentList.IsPaymentFromCustomerByPOS)
		|
		|UNION ALL
		|
		|SELECT
		|	OffsetPartnersBalance.RecordType_Reverse,
		|	OffsetPartnersBalance.Period,
		|	OffsetPartnersBalance.Company,
		|	OffsetPartnersBalance.Branch,
		|	OffsetPartnersBalance.Partner,
		|	OffsetPartnersBalance.LegalName,
		|	OffsetPartnersBalance.TransactionAgreement,
		|	OffsetPartnersBalance.TransactionDocument,
		|	OffsetPartnersBalance.Currency,
		|	0 AS Amount,
		|	CASE
		|		WHEN OffsetPartnersBalance.IsPaymentFromCustomer
		|		OR OffsetPartnersBalance.IsPaymentFromCustomerByPOS
		|			THEN OffsetPartnersBalance.Amount
		|		ELSE 0
		|	END AS CustomerTransaction,
		|	0 AS CustomerAdvance,
		|	CASE
		|		WHEN OffsetPartnersBalance.IsReturnFromVendor
		|			THEN OffsetPartnersBalance.Amount
		|		ELSE 0
		|	END AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	OffsetPartnersBalance.AdvancesClosing,
		|	OffsetPartnersBalance.Key
		|FROM
		|	OffsetPartnersBalance AS OffsetPartnersBalance
		|WHERE
		|	(OffsetPartnersBalance.IsPaymentFromCustomer
		|	OR OffsetPartnersBalance.IsReturnFromVendor
		|	OR OffsetPartnersBalance.IsPaymentFromCustomerByPOS)
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(AccumulationRecordType.Expense) AS RecordType,
		|	PaymentList.Period,
		|	PaymentList.Company,
		|	PaymentList.Branch,
		|	PaymentList.Partner,
		|	PaymentList.LegalName,
		|	PaymentList.Agreement,
		|	UNDEFINED AS Document,
		|	PaymentList.Currency,
		|	0 AS Amount,
		|	0 AS CustomerTransaction,
		|	0 AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	PaymentList.Amount AS OtherTransaction,
		|	UNDEFINED AS AdvancesClosing,
		|	PaymentList.Key
		|FROM
		|	PaymentList AS PaymentList
		|WHERE
		|	PaymentList.IsOtherPartner";
EndFunction

Function R5020B_PartnersBalance_PI() Export
	Return 
		"SELECT
		|	VALUE(AccumulationRecordType.Expense) AS RecordType,
		|	ItemList.Period,
		|	ItemList.Company,
		|	ItemList.Branch,
		|	ItemList.Partner,
		|	ItemList.LegalName,
		|	ItemList.Agreement,
		|	ItemList.BasisDocument AS Document,
		|	ItemList.Currency,
		|	0 AS Amount,
		|	0 AS CustomerTransaction,
		|	0 AS CustomerAdvance,
		|	SUM(ItemList.Amount) AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	UNDEFINED AS AdvancesClosing,
		|	UNDEFINED AS Key
		|INTO R5020B_PartnersBalance
		|FROM
		|	ItemList AS ItemList
		|WHERE
		|	ItemList.IsPurchase
		|GROUP BY
		|	VALUE(AccumulationRecordType.Expense),
		|	ItemList.Period,
		|	ItemList.Company,
		|	ItemList.Branch,
		|	ItemList.Partner,
		|	ItemList.LegalName,
		|	ItemList.Agreement,
		|	ItemList.BasisDocument,
		|	ItemList.Currency
		|
		|UNION ALL
		|
		|SELECT
		|	CASE
		|		WHEN OffsetOfAdvances.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Receipt)
		|		ELSE VALUE(AccumulationRecordType.Expense)
		|	END,
		|	OffsetOfAdvances.Period,
		|	OffsetOfAdvances.Company,
		|	OffsetOfAdvances.Branch,
		|	OffsetOfAdvances.Partner,
		|	OffsetOfAdvances.LegalName,
		|	OffsetOfAdvances.AdvanceAgreement,
		|	UNDEFINED,
		|	OffsetOfAdvances.Currency,
		|	0 AS Amount,
		|	0 AS CustomerTransaction,
		|	0 AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	OffsetOfAdvances.Amount AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	OffsetOfAdvances.Recorder,
		|	UNDEFINED
		|FROM
		|	InformationRegister.T2010S_OffsetOfAdvances AS OffsetOfAdvances
		|WHERE
		|	OffsetOfAdvances.Document = &Ref
		|	AND OffsetOfAdvances.Recorder REFS Document.VendorsAdvancesClosing
		|
		|UNION ALL
		|
		|SELECT
		|	CASE
		|		WHEN OffsetOfAdvances.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Expense)
		|		ELSE VALUE(AccumulationRecordType.Receipt)
		|	END,
		|	OffsetOfAdvances.Period,
		|	OffsetOfAdvances.Company,
		|	OffsetOfAdvances.Branch,
		|	OffsetOfAdvances.Partner,
		|	OffsetOfAdvances.LegalName,
		|	OffsetOfAdvances.TransactionAgreement,
		|	OffsetOfAdvances.TransactionDocument,
		|	OffsetOfAdvances.Currency,
		|	0 AS Amount,
		|	0 AS CustomerTransaction,
		|	0 AS CustomerAdvance,
		|	SUM(OffsetOfAdvances.Amount),
		|	0 AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	OffsetOfAdvances.Recorder,
		|	UNDEFINED
		|FROM
		|	InformationRegister.T2010S_OffsetOfAdvances AS OffsetOfAdvances
		|WHERE
		|	OffsetOfAdvances.Document = &Ref
		|	AND OffsetOfAdvances.Recorder REFS Document.VendorsAdvancesClosing
		|GROUP BY
		|	CASE
		|		WHEN OffsetOfAdvances.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Expense)
		|		ELSE VALUE(AccumulationRecordType.Receipt)
		|	END,
		|	OffsetOfAdvances.Period,
		|	OffsetOfAdvances.Company,
		|	OffsetOfAdvances.Branch,
		|	OffsetOfAdvances.Partner,
		|	OffsetOfAdvances.LegalName,
		|	OffsetOfAdvances.TransactionAgreement,
		|	OffsetOfAdvances.TransactionDocument,
		|	OffsetOfAdvances.Currency,
		|	OffsetOfAdvances.Recorder";
EndFunction

Function R5020B_PartnersBalance_SI() Export
	Return 
		"SELECT
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	ItemList.Period,
		|	ItemList.Company,
		|	ItemList.Branch,
		|	ItemList.Partner,
		|	ItemList.LegalName,
		|	ItemList.Agreement,
		|	ItemList.BasisDocument AS Document,
		|	ItemList.Currency,
		|	0 AS Amount,
		|	0 AS CustomerTransaction,
		|	SUM(ItemList.Amount) AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	UNDEFINED AS AdvancesClosing,
		|	UNDEFINED AS Key
		|INTO R5020B_PartnersBalance
		|FROM
		|	ItemList AS ItemList
		|WHERE
		|	ItemList.IsPurchase
		|GROUP BY
		|	VALUE(AccumulationRecordType.Receipt),
		|	ItemList.Period,
		|	ItemList.Company,
		|	ItemList.Branch,
		|	ItemList.Partner,
		|	ItemList.LegalName,
		|	ItemList.Agreement,
		|	ItemList.BasisDocument,
		|	ItemList.Currency
		|
		|UNION ALL
		|
		|SELECT
		|	CASE
		|		WHEN OffsetOfAdvances.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Receipt)
		|		ELSE VALUE(AccumulationRecordType.Expense)
		|	END,
		|	OffsetOfAdvances.Period,
		|	OffsetOfAdvances.Company,
		|	OffsetOfAdvances.Branch,
		|	OffsetOfAdvances.Partner,
		|	OffsetOfAdvances.LegalName,
		|	OffsetOfAdvances.AdvanceAgreement,
		|	UNDEFINED,
		|	OffsetOfAdvances.Currency,
		|	0 AS Amount,
		|	0 AS CustomerTransaction,
		|	OffsetOfAdvances.Amount AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	OffsetOfAdvances.Recorder,
		|	UNDEFINED
		|FROM
		|	InformationRegister.T2010S_OffsetOfAdvances AS OffsetOfAdvances
		|WHERE
		|	OffsetOfAdvances.Document = &Ref
		|	AND OffsetOfAdvances.Recorder REFS Document.CustomersAdvancesClosing
		|
		|UNION ALL
		|
		|SELECT
		|	CASE
		|		WHEN OffsetOfAdvances.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Expense)
		|		ELSE VALUE(AccumulationRecordType.Receipt)
		|	END,
		|	OffsetOfAdvances.Period,
		|	OffsetOfAdvances.Company,
		|	OffsetOfAdvances.Branch,
		|	OffsetOfAdvances.Partner,
		|	OffsetOfAdvances.LegalName,
		|	OffsetOfAdvances.TransactionAgreement,
		|	OffsetOfAdvances.TransactionDocument,
		|	OffsetOfAdvances.Currency,
		|	0 AS Amount,
		|	SUM(OffsetOfAdvances.Amount),
		|	0 AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	OffsetOfAdvances.Recorder,
		|	UNDEFINED
		|FROM
		|	InformationRegister.T2010S_OffsetOfAdvances AS OffsetOfAdvances
		|WHERE
		|	OffsetOfAdvances.Document = &Ref
		|	AND OffsetOfAdvances.Recorder REFS Document.CustomersAdvancesClosing
		|GROUP BY
		|	CASE
		|		WHEN OffsetOfAdvances.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Expense)
		|		ELSE VALUE(AccumulationRecordType.Receipt)
		|	END,
		|	OffsetOfAdvances.Period,
		|	OffsetOfAdvances.Company,
		|	OffsetOfAdvances.Branch,
		|	OffsetOfAdvances.Partner,
		|	OffsetOfAdvances.LegalName,
		|	OffsetOfAdvances.TransactionAgreement,
		|	OffsetOfAdvances.TransactionDocument,
		|	OffsetOfAdvances.Currency,
		|	OffsetOfAdvances.Recorder";
EndFunction

Function R5020B_PartnersBalance_RSR() Export
		Return 
			"SELECT
			|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
			|	ItemList.Period,
			|	ItemList.Company,
			|	ItemList.Branch,
			|	ItemList.Partner,
			|	ItemList.LegalName,
			|	ItemList.Agreement,
			|	ItemList.BasisDocument AS Document,
			|	ItemList.Currency,
			|	0 AS Amount,
			|	SUM(ItemList.TotalAmount) AS CustomerTransaction,
			|	0 AS CustomerAdvance,
			|	0 AS VendorTransaction,
			|	0 AS VendorAdvance,
			|	0 AS OtherTransaction,
			|	UNDEFINED AS AdvancesClosing
			|INTO R5020B_PartnersBalance
			|FROM
			|	ItemList AS ItemList
			|WHERE
			|	ItemList.UsePartnerTransactions
			|	AND ItemList.StatusType = VALUE(ENUM.RetailReceiptStatusTypes.Completed)
			|GROUP BY
			|	ItemList.Period,
			|	ItemList.Company,
			|	ItemList.Branch,
			|	ItemList.Partner,
			|	ItemList.LegalName,
			|	ItemList.Agreement,
			|	ItemList.BasisDocument,
			|	ItemList.Currency,
			|	VALUE(AccumulationRecordType.Receipt)
			|
			|UNION ALL
			|
			|SELECT
			|	VALUE(AccumulationRecordType.Expense) AS RecordType,
			|	ItemList.Period,
			|	ItemList.Company,
			|	ItemList.Branch,
			|	ItemList.Partner,
			|	ItemList.LegalName,
			|	ItemList.Agreement,
			|	ItemList.BasisDocument AS Document,
			|	ItemList.Currency,
			|	0 AS Amount,
			|	SUM(ItemList.TotalAmount) AS CustomerTransaction,
			|	0 AS CustomerAdvance,
			|	0 AS VendorTransaction,
			|	0 AS VendorAdvance,
			|	0 AS OtherTransaction,
			|	UNDEFINED AS AdvancesClosing
			|FROM
			|	ItemList AS ItemList
			|WHERE
			|	ItemList.UsePartnerTransactions
			|	AND ItemList.StatusType = VALUE(ENUM.RetailReceiptStatusTypes.Completed)
			|GROUP BY
			|	ItemList.Period,
			|	ItemList.Company,
			|	ItemList.Branch,
			|	ItemList.Partner,
			|	ItemList.LegalName,
			|	ItemList.Agreement,
			|	ItemList.BasisDocument,
			|	ItemList.Currency,
			|	VALUE(AccumulationRecordType.Expense)";
EndFunction	

Function R5020B_PartnersBalance_SR() Export
	Return 
		"SELECT
		|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		|	ItemList.Period,
		|	ItemList.Company,
		|	ItemList.Branch,
		|	ItemList.Partner,
		|	ItemList.LegalName,
		|	ItemList.Agreement,
		|	ItemList.BasisDocument AS Document,
		|	ItemList.Currency,
		|	0 AS Amount,
		|	-SUM(ItemList.Amount) AS CustomerTransaction,
		|	0 AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	UNDEFINED AS AdvancesClosing
		|INTO R5020B_PartnersBalance
		|FROM
		|	ItemList AS ItemList
		|WHERE
		|	ItemList.IsReturnFromCustomer
		|GROUP BY
		|	ItemList.Period,
		|	ItemList.Company,
		|	ItemList.Branch,
		|	ItemList.Partner,
		|	ItemList.LegalName,
		|	ItemList.Agreement,
		|	ItemList.BasisDocument,
		|	ItemList.Currency,
		|	VALUE(AccumulationRecordType.Receipt)
		|
		|UNION ALL
		|
		|SELECT
		|	CASE
		|		WHEN OffsetOfAdvances.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Receipt)
		|		ELSE VALUE(AccumulationRecordType.Expense)
		|	END,
		|	OffsetOfAdvances.Period,
		|	OffsetOfAdvances.Company,
		|	OffsetOfAdvances.Branch,
		|	OffsetOfAdvances.Partner,
		|	OffsetOfAdvances.LegalName,
		|	OffsetOfAdvances.TransactionAgreement,
		|	OffsetOfAdvances.TransactionDocument,
		|	OffsetOfAdvances.Currency,
		|	0 AS Amount,
		|	OffsetOfAdvances.Amount AS CustomerTransaction,
		|	0 AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	OffsetOfAdvances.Recorder
		|FROM
		|	InformationRegister.T2010S_OffsetOfAdvances AS OffsetOfAdvances
		|WHERE
		|	OffsetOfAdvances.Document = &Ref
		|	AND OffsetOfAdvances.Recorder REFS Document.CustomersAdvancesClosing
		|
		|UNION ALL
		|
		|SELECT
		|	CASE
		|		WHEN OffsetOfAdvances.RecordType = VALUE(Enum.RecordType.Receipt)
		|			THEN VALUE(AccumulationRecordType.Receipt)
		|		ELSE VALUE(AccumulationRecordType.Expense)
		|	END AS RecordType,
		|	OffsetOfAdvances.Period,
		|	OffsetOfAdvances.Company,
		|	OffsetOfAdvances.Branch,
		|	OffsetOfAdvances.Partner,
		|	OffsetOfAdvances.LegalName,
		|	OffsetOfAdvances.AdvanceAgreement AS Agreement,
		|	UNDEFINED,
		|	OffsetOfAdvances.Currency,
		|	0 AS Amount,
		|	0 AS CustomerTransaction,
		|	OffsetOfAdvances.Amount AS CustomerAdvance,
		|	0 AS VendorTransaction,
		|	0 AS VendorAdvance,
		|	0 AS OtherTransaction,
		|	OffsetOfAdvances.Recorder
		|FROM
		|	InformationRegister.T2010S_OffsetOfAdvances AS OffsetOfAdvances
		|WHERE
		|	OffsetOfAdvances.Document = &Ref
		|	AND OffsetOfAdvances.Recorder REFS Document.CustomersAdvancesClosing";
		
EndFunction
